BAS BMEKZU Project/src/Catalogs/ВидыВыплат/ВидыВыплат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыВыплат</name>
  <predefined>
    <items>
      <name>Аванс</name>
      <description>Аванс</description>
    </items>
    <items>
      <name>АвансПредварительныйРасчет</name>
      <description>Аванс (по предварительному расчету)</description>
    </items>
    <items>
      <name>Больничные</name>
      <description>Больничные</description>
    </items>
    <items>
      <name>Депоненты</name>
      <description>Депоненты</description>
    </items>
    <items>
      <name>Дивиденды</name>
      <description>Дивиденды</description>
    </items>
    <items>
      <name>ЗакрытиеПериода</name>
      <description>Закрытие периода</description>
    </items>
    <items>
      <name>ЗакрытиеПериодаВзаиморасчеты</name>
      <description>Закрытие периода (НДФЛ и взносы) (не использовать)</description>
    </items>
    <items>
      <name>НДФЛКонтрагентам</name>
      <description>НДФЛ Контрагентам</description>
    </items>
    <items>
      <name>Отпуск</name>
      <description>Отпуск</description>
    </items>
    <items>
      <name>Очередная</name>
      <description>Очередная</description>
    </items>
    <items>
      <name>ОчереднаяПогашениеДолгов</name>
      <description>Очередная с погашением долгов</description>
    </items>
    <items>
      <name>ОчереднаяВзносы</name>
      <description>Перечисление взносов в фонды (очередная)</description>
    </items>
    <items>
      <name>ОчереднаяПогашениеДолговВзносы</name>
      <description>Перечисление взносов в фонды (погашение долгов)</description>
    </items>
    <items>
      <name>НДФЛБезВыплатыЗарплаты</name>
      <description>Перечисление НДФЛ (без выплаты зарплаты)</description>
    </items>
  </predefined>
  <attributes>
    <name>ИНАГРО_ВидРасчета</name>
    <type>
      <types>ChartOfCalculationTypesRef.ИНАГРО_Начисления</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетОтОбратного</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчитыватьВзносы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>Начисление</name>
      <type>
        <types>ChartOfCalculationTypesRef.Начисления</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

BAS BMEKZU Project/src/CommonModules/ВзаиморасчетыССотрудникамиКлиентБазовый/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


Процедура ВедомостьУстановитьВидимостьПоСпособуВыплаты(Форма) Экспорт
	
	СтруктураВидимости = Новый Структура();
	СтруктураВидимости.Вставить("Зарплата", Истина);
	СтруктураВидимости.Вставить("ЗарплатаПодробно", Истина);
	СтруктураВидимости.Вставить("НДФЛ", Истина);
	СтруктураВидимости.Вставить("Взносы", Истина);
	СтруктураВидимости.Вставить("РассчитыватьНалоги", Ложь);
	
	СпособВыплаты = Форма.Объект.СпособВыплаты;
	
	//Здесь указываем, когда и какие табличные части не нужны
	Если СпособВыплаты = ПредопределенноеЗначение("Справочник.ВидыВыплат.Очередная") 
	или СпособВыплаты = ПредопределенноеЗначение("Справочник.ВидыВыплат.ОчереднаяПогашениеДолгов")  Тогда
		СтруктураВидимости.Взносы  = Ложь;
	ИначеЕсли СпособВыплаты = ПредопределенноеЗначение("Справочник.ВидыВыплат.ОчереднаяВзносы") 
	или СпособВыплаты = ПредопределенноеЗначение("Справочник.ВидыВыплат.ОчереднаяПогашениеДолговВзносы")  
	Тогда
		СтруктураВидимости.Зарплата  = Ложь;
		СтруктураВидимости.ЗарплатаПодробно  = Ложь;
		СтруктураВидимости.НДФЛ  = Ложь;
	ИначеЕсли СпособВыплаты = ПредопределенноеЗначение("Справочник.ВидыВыплат.НДФЛБезВыплатыЗарплаты")
	или СпособВыплаты = ПредопределенноеЗначение("Справочник.ВидыВыплат.НДФЛКонтрагентам")  	
	Тогда	
		СтруктураВидимости.Зарплата  = Ложь;
		СтруктураВидимости.ЗарплатаПодробно  = Ложь;
		СтруктураВидимости.Взносы  = Ложь;
	ИначеЕсли СпособВыплаты = ПредопределенноеЗначение("Справочник.ВидыВыплат.Депоненты")
	Тогда	
		СтруктураВидимости.Зарплата  = Истина;
		СтруктураВидимости.ЗарплатаПодробно  = Истина;
		СтруктураВидимости.Взносы  = Ложь;
		СтруктураВидимости.НДФЛ  = Ложь;
	КонецЕсли;
	
	//Здесь указываем, когда может потребоваться расчет налогов и взносов
	СтруктураВидимости.РассчитыватьНалоги = Форма.РассчитыватьНалоги;
	
	Форма.Элементы.ЗарплатаГруппа.Видимость = СтруктураВидимости.Зарплата;
	Форма.Элементы.ЗарплатаПодробноГруппа.Видимость = СтруктураВидимости.ЗарплатаПодробно;
	Форма.Элементы.НДФЛГруппа.Видимость = СтруктураВидимости.НДФЛ;
	Форма.Элементы.ВзносыГруппа.Видимость = СтруктураВидимости.Взносы;
	Форма.Элементы.ВзносыФОТГруппа.Видимость = СтруктураВидимости.Взносы;
	Форма.Элементы.РассчитатьНалоги.Видимость = СтруктураВидимости.РассчитыватьНалоги;
	Форма.Элементы.ЗарплатаПодробноСуммаГрязными.Видимость = СтруктураВидимости.РассчитыватьНалоги;
	Форма.Элементы.ЗарплатаПодробноВедомость.Видимость = (СпособВыплаты = ПредопределенноеЗначение("Справочник.ВидыВыплат.Депоненты"));
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции ведомостей на выплату зарплаты

// Обработчики событий формы

Процедура ВедомостьОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник) Экспорт
	
	Если ИмяСобытия = ВзаиморасчетыССотрудникамиКлиент.ИмяСобытияИзмененияОплатыВедомости() Тогда
		Форма.УстановитьДоступностьЭлементов();
	КонецЕсли;
	
КонецПроцедуры

// Обработчики событий элементов шапки

Процедура ВедомостьСпособВыплатыПриИзменении(Форма, Элемент) Экспорт
	
	ВзаиморасчетыССотрудникамиКлиент.ВедомостьУстановитьВидимостьПоСпособуВыплаты(Форма);
	
КонецПроцедуры


// Редактирование и представление параметров расчета

Процедура ВедомостьИзменитьПараметрыРасчета(Форма, ОповещениеЗавершения = Неопределено) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", Форма);
	ДополнительныеПараметры.Вставить("СтароеОкругление", Форма.Объект.Округление);
	ДополнительныеПараметры.Вставить("ОповещениеЗавершения", ОповещениеЗавершения);
	
	Оповещение = Новый ОписаниеОповещения("ВедомостьИзменитьПараметрыРасчетаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	Форма.ПоказатьВыборИзМеню(Оповещение, Форма.СпособыОкругления);
	
КонецПроцедуры

Процедура ВедомостьИзменитьПараметрыРасчетаЗавершение(Выбор, ДополнительныеПараметры) Экспорт

	Форма = ДополнительныеПараметры.Форма;
	СтароеОкругление = ДополнительныеПараметры.СтароеОкругление;
	ОповещениеЗавершения = ДополнительныеПараметры.ОповещениеЗавершения;
	
	Если Выбор <> Неопределено И Выбор.Значение <> СтароеОкругление Тогда
		Форма.Объект.Округление = Выбор.Значение;
		Форма.Рассчитать(Неопределено)
	КонецЕсли;
	
	Если ОповещениеЗавершения <> Неопределено Тогда 
		ВыполнитьОбработкуОповещения(ОповещениеЗавершения, Выбор = Неопределено);
	КонецЕсли;
	
КонецПроцедуры	
	
Функция ВедомостьПредставлениеПараметровРасчета(Форма) Экспорт

	ПредставлениеПараметровРасчета = Строка(Форма.Объект.Округление);
	
	Возврат ПредставлениеПараметровРасчета;
	
КонецФункции
